var questions = [
    {
        "question":"1.你是否比較合群，還是比較傾向和別人保持一定距離？",
        "answers":[
            ["我十分合群",0],
            ["我和別人的關係一般",1],
            ["我盡量不與任何人保持特別親密的關係",2]
        ]
    },
    {
        "question":"2.你是否自信滿滿，並且一定要在你參加的比賽中拿第一？",
        "answers":[
            ["是的。我在任何我所參加的比賽中都要拿第一，我討厭失敗",2],
            ["我在比賽中很自信，但失敗並不會對我有很大的影響",1],
            ["除了賽車運動外，我搞體育只是為了享受，輸贏對我並不重要",0]
      ]
    },
    {
        "question":"3.如果有車手在比賽中對你有不公平競爭，你會",
        "answers":[
            ["繼續前進，尋找報復的機會",1],
            ["當場暴怒並且立刻報復他",0],
            ["試著保持冷靜，完整地跑完比賽后再與他理論",2]
        ]
    },
    {
        "question":"4.人們說你很衝動嗎？",
        "answers":[
            ["有時是的",1],
            ["幾乎沒有",2],
            ["是的，經常",0]
        ]
    },
    {
        "question":"5.你是否很樂於看到人們對你的比賽感興趣，並提出很多的問題？",
        "answers":[
            ["一般來說，是的。我會盡力禮貌地回答",0],
            ["只要問的不是很誇張，我還是很樂於回答的",1],
            ["不，那會使我很緊張，我會盡力迴避他們",2]
        ]
    },
    {
        "question":"6.你希望你的行為方式贏得別人的羨慕嗎？",
        "answers":[
            ["是的，但不是一直都這樣",1],
            ["是的，我非常希望如此",0],
            ["不，我不太感興趣",2]
        ]
    },
    {
        "question":"7.你是否輕鬆早起，還是會躲在被窩睡懶覺？",
        "answers":[
            ["鬧鐘一響我就起床",2],
            ["我起床不是很拖拉",1],
            ["我能賴多久就賴多久",0]
        ]
    },
    {
        "question":"8.如果你的朋友比你更有激情，你會？",
        "answers":[
            ["我會比他更瘋狂",0],
            ["我比他們少點激情也無妨",2],
            ["保持和他們一樣的激情",1]
        ]
    },
    {
        "question":"9.你是否很武斷，偏執於自己的決定？",
        "answers":[
            ["有時候",1],
            ["是的，我一向很固執",2],
            ["很少",0]
        ]
    },
    {
        "question":"10.比賽中，你會堅持公平原則還是會很有攻擊性？",
        "answers":[
            ["我的表現跟其他的車手差不多",1],
            ["我一定會堅持公平原則",2],
            ["我想我一定會很有攻擊性",0]
        ]
    },
    
    {
        "question":"11.你在學生時代是比較規矩還是很調皮的？",
        "answers":[
            ["不太守規矩，我討厭條條框框",0],
            ["比較規矩",2],
            ["平時較為規矩，但是也會破例",1]
        ]
    },
    
    {
        "question":"12.在人際關係方面，你是？",
        "answers":[
            ["真誠，自然，自由和灑脫",0],
            ["如果可以帶來好處我會撒謊",2],
            ["我不知道，因為我很善變",1]
        ]
    },

    {
        "question":"13.你認為自己對規則的關注度如何？",
        "answers":[
            ["可能不太夠",0],
            ["我很關注但是並不在乎",1],
            ["是的，非常關注",2]
        ]
    },

    {
        "question":"14.如果你的成績不夠理想，你會非常不高興，或者傷心緊張嗎？ ",
        "answers":[
            ["有幾次是的",0],
            ["只有一兩次",1],
            ["我不認為我會那樣",2]
        ]
    },

    {
        "question":"15.你面對大眾時會害羞嗎？",
        "answers":[
            ["是的，經常",2],
            ["有時，要看但是的環境",1],
            ["不，我不是一個害羞的人",0]
        ]
    },
    
    {
        "question":"16.如果你要花一個下午時間學習，你是否會先集中自己的注意力？ ",
        "answers":[
            ["是的，這樣會使後面的效率更高",0],
            ["不，我一開始學習注意力最集中",2],
            ["一般來說我的注意力非常集中，不會分心",1]
        ]
    },
    
    {
        "question":"17.如果你是F1車手，在比賽前什麼會困擾你",
        "answers":[
            ["我最受不了那些無所事事大放厥詞的傢伙",0],
            ["沒有什麼可以困擾我",2],
            ["要看當時的情況",1]
        ]
    },
    
    {
        "question":"18.在做重大決定時，你會？",
        "answers":[
            ["根據直覺",0],
            ["根據理智",2],
            ["要看環境來定",1]
        ]
    },
    
    {
        "question":"19.你很容易被冒犯嗎？",
        "answers":[
            ["是的，非常容易",2],
            ["一定不會",0],
            ["一般",1]
        ]
    },
    
    {
        "question":"20.當你和朋友激烈討論時，你會？",
        "answers":[
            ["和他們一起討論",1],
            ["很興奮並大聲講話",0],
            ["不介入只是傾聽",2]
        ]
    },
    
    {
        "question":"21.你是否介意別人對你的看法？",
        "answers":[
            ["非常",0],
            ["不是很在意",1],
            ["從不在意",2]
        ]
    },
    
    {
        "question":"22.如果你贏得了冠軍，而你的隊友在以下那個位置你最高興？",
        "answers":[
            ["和你一起登上領獎台",0],
            ["最後一名或者中途退出",2],
            ["只要沒有登上領獎台就好",1]
        ]
    },
    
    
    {
        "question":"23.你認為別人會妒忌你的生活方式嗎？",
        "answers":[
            ["不會",0],
            ["是的",2],
            ["有時會",1]
        ]
    },
    
    {
        "question":"24.在孩提時代，你受到不公平的對待，會怎麼做？",
        "answers":[
            ["非常生氣，但是很快會忘記",2],
            ["非常憤怒，會使用暴力",0],
            ["我默默忍受，但是會生氣很久",1]
        ]
    },
    
    {
        "question":"25.被批評時你會怎麼做？",
        "answers":[
            ["我很生氣，認為錯不在我",0],
            ["那要看什麼人批評我了",1],
            ["批評對我沒有什麼影響",2]
        ]
    },
    
    
    
    
];

var finalAnswers={
        "A":["天啊！你根本沒有這種開車的能力，更不要說F1賽車了。看在上帝的份上，遠離馬路。我建議你終生走路，而且慢慢走，不要跑。"],
        "B":["你還不夠好，不是嗎？沒有一個車隊的老闆會要你這樣冒冒失失的傢伙來駕駛昂貴的F1賽車。你太容易生氣了，失火的加農炮，還是回家吧。"],
        "C":["還不錯，但是還可以更加好。你有成為車手的潛力。可惜你的自製力還不夠。很遺憾！"],
        "D":["現在我們可以好好聊聊了。你可能不能成為邁克爾，但是你能夠成為拉爾夫。你完全有F1車手的心理素質。"],
        "E":["你還在等什麼？馬上打電話給法蘭克·威廉姆斯，告訴他你下個賽季就加入他的車隊。威廉姆斯下個賽季的兩個車手位都還是空著呢。告訴他，你一定會成為下一個邁克爾·舒馬赫！"]
};
